# Общие ошибки
ERROR_MAIN_1 = 'Неверно указана тема пояснительной записки.'
ERROR_MAIN_2 = 'Неверно указан шифр пояснительной записки.'
ERROR_MAIN_3 = 'Факультет, кафедра или профиль указаны неверно.'
ERROR_MAIN_4 = 'Год написания пояснительной записки указан неверно.'
ERROR_MAIN_5 = 'Неверно указан номер или дата приказа.'
ERROR_MAIN_6 = 'Неверно указаны исходные данные пояснительной записки.'
ERROR_MAIN_7 = 'Неверно указано число листов в штампе структурного элемента.'
ERROR_MAIN_8 = 'Закладка не определена.'

# Оформление текста
ERROR_TEXT_1 = 'Некорректное форматирование текста.'
ERROR_TEXT_2 = 'Орфографическая ошибка.'
ERROR_TEXT_3 = 'Межстрочный интервал задан неверно.'
ERROR_TEXT_4 = 'Абзационный отступ задан неверно.'

# Заголовки
ERROR_HEAD_1 = 'Заголовок расположен неверно.'
ERROR_HEAD_2 = 'В заголовке используется неверный размер шрифта.'
ERROR_HEAD_3 = 'Заголовок не соответствует содержанию.'

# Список
ERROR_LIST_1 = 'Список оформлен неверно.'

# Таблица
ERROR_TABLE_1 = 'Таблица расположена неверно.'
ERROR_TABLE_2 = 'Название таблицы расположено неверно.'
ERROR_TABLE_3 = 'Номер таблицы указан неверно.'
ERROR_TABLE_4 = 'Отсутствует ссылка на таблицу по тексту.'

# Рисунок
ERROR_IMAGE_1 = 'Рисунок расположен неверно.'
ERROR_IMAGE_2 = 'Подрисуночная надпись расположена неверно.'
ERROR_IMAGE_3 = 'Некорректный номер рисунка.'
ERROR_IMAGE_4 = 'Отсутствует ссылка на рисунок по тексту.'

# Формула
ERROR_FORMULA_1 = 'Формула расположена неверно.'
ERROR_FORMULA_2 = 'Номер формулы расположен неверно.'
ERROR_FORMULA_3 = 'Отсутствует ссылка на формулу по тексту.'

# Рамки
ERROR_FRAME_1 = 'Не выдержан интервал от текста до рамки.'
# <a href="1231231">Пример</a>'
ERROR_FRAME_2 = 'Неверно указано число листов в основной рамке.'

# Ссылки
ERROR_LINK_1 = 'Отсутствуют ссылки на использованные источники.'
ERROR_LINK_2 = 'Ссылки на источники оформлены неверно.'
